package com.eomcs.basic.ex04;

public class Exam21 {
  public static void main(String[] args) {
    //
    byte b; // 1바이트 -128 ~ 127 까지 저장 가능

    b = -128;
    b = 127;

    // b = -129;
    // b = 128;

    short s; // 2바이트 -32768 ~ 32767

    s = -32768;
    s = 32767;

    // s = -32769;
    // s = 32768;

    int i; // 4바이트 약 -21억 ~ 21억

    i = -21_0000_0000;
    i = 21_0000_0000;

    // i = -22_0000_0000;
    // i = 22_0000_0000;


    long l; // 8바이트 약 -922경 ~ 922경

    l = -922_0000_0000_0000_0000L; // 꼭 뒤에 L 붙여줘야 함
    l = 922_0000_0000_0000_0000L;

    // l = -923_0000_0000_0000_0000L; 
    // l = 923_0000_0000_0000_0000L;
  }
}